const opisaniyaLet = {
  state: () => ({
    OPISANIYA_LET: [
      "",
      "",
      "",
      "",
      "\nВ этот год происходят глобальные изменения, касающиеся не только жизни людей, но и самой природы. \n\
Это отражается в небесных и земных катаклизмах связанных с огненными стихиями, которые влияют на всё живое. \n\
Происходящие изменения в природе заставляют людей менять места своего проживания,  \n\
а это в свою очередь приводит к различным конфликтам и войнам. \n\
Это время для подведения итогов по свершонным делам и составления новых планов для дальнейней жизни общества.  \n\
В год Огненного Свитка рождаются люди с ярким, мистическим складом ума.  \n\
Они светятся от наплыва различных идей, активны на работе и дома. Их творческая натура горит как огонь.  \n\
Но их нельзя допускать к сферам связанным с оружием, иначе они сожгут всё вокруг себя.\n",
      "\nВ этот год происходят очень резкие изменения в природе и жизни людей, словно пламя огня мечется на ветру. \n\
Жаркая погода может быстро смениться на холодную и наоборот. Привычные уклады жизни станут меняться. \n\
Многое новое будет отринуто, а забытое старое начнёт возрождаться. Всё это будет происходит порывисто. \n\
Во многих местах жить станет затруднительно и люди начнут искать себе новое место для жизни. \n\
Если люди не приложат сил для укрепления мирной жизни, то во многих местах Земли начнутся войны. \n\
В год Огненного Феникса рождаются одухотворённые люди с ярким, огненным характером. \n\
Способные своим духовным порывом зажигать свет в душах других людей. \n\
Но все их устремления необходимо сдерживать, иначе они могут сгореть воплощая свои идеи.\n",
      "\nВремя благоприятное для расширения территории державы. Оно может происходить по-разному, как при помощи войн, \n\
так и ненасильственно, а за счет добровольного присоединения мелких территорий к более крупным. \n\
В лето Солнечного Лиса отмечается рассвет производительных сил, особенно в военной и оборонной сфере. \n\
Рожденные в это время люди, стремятся не столько к Духовной гармонии или к созидательной, \n\
сколько к изменению окружающего мира, для блага своих родов и своей семьи. Эти люди очень любят детей, \n\
они не воспринимают жизнь без большой семьи и множества детей.\n",
      "\nВремя, когда обществу надоедает постоянная рознь и люди объединяются на борьбу с теми, кто вносит раздор \n\
в повседневную жизнь и создаёт тяжёлые условия для жизни народов. Правильнее это лето назвать, летом борьбы \n\
за справедливость. Это лето приносит не только засуху, пылевые бури, пожары, голод, как следствие гибели урожая, \n\
который сгорает на корню, но вооруженные противостояния за обладание сохранённым продовольствием. \n\
В лето Золотого Дракона рождаются люди  наделенные необычайными способностями, поэтому вся жизнь их проходит \n\
в развитии и применении своего дара. Эти люди не терпят злословия в свой адрес, а последствия для людей от их \n\
воздействия и наказания бывают ужасны.\n",
      "\nВремя воплощения в жизнь непродуманных идей, навязанных людям при помощи хитрости и обмана. \n\
Всё это навязывается чуждым мировозрением, которое приносит разброд в привычное сознание общества.  \n\
Но так или иначе, все непродуманные идеи чужих заканчиваются полным крахом. В лето Лесного Змея рождаются \n\
люди с недоверчивым характером, они долго всё обдумывают и стараются никогда не принимать быстрых решений. \n\
При помощи хитрости они стараются переложить всё на чужие плечи, считая что кто-то за них может принять \n\
окончательно решение или избавит их от каких-то проблем. Как правило, вся их жизнь проходит в мечтах. \n\
Единственно полезное, что они могут сделать для общества, это породить много детей, которые по характеру \n\
абсолютно не походят на них.\n",
      "\nВремя относительного покоя, гармонии и обустроенности в жизни общества. Любые попытки внести какие-нибудь \n\
изменения в существующее состояние в обществе, обречены на провал, так как люди не воспринимают \n\
чужие идеи и новшества. В лето Лесного Орла рождаются люди с чувством гармоничного единства с окружающим миром. \n\
Любые искусственные или неестественные условия жизни, вызывают в них чувство замкнутости и раздражительности, \n\
что в последствии приводит их в состояние разрушающей агрессивности. Они предпочитают заниматься делами, \n\
которые не наносят вред окружающему миру природы.\n",
      "\nВремя спокойного развития в обществе, когда появляются всевозможные новые виды творчества, основанные \n\
на древних корнях прошлого. Искусство старается проникнуть во все сферы научной деятельности, \n\
отрываясь от духовной жизни людей. В лето Небесного Дельфина рождаются люди с обостренным чувством \n\
собственного достоинства. Они прекрасно чувствуют окружающие их тонкие энергии, и пытаются на их основе \n\
создать что-то необычное для развития повседневной жизни. Удачные результаты делают из них людей идущих \n\
по Светлому пути, а неудачи приводят их на Темный путь.\n",
      "\nВремя наибольшей опасности для повседневной жизни общества. Эта опасность исходит от непредсказуемых \n\
решений правителей и их окружения. В это лето, правителям держав, необходимо обратить внимание на то, \n\
что их окружение готовит множесчтво ненужных законов нарушающих спокойную жизнь в державе. \n\
В лето Небесного Коня рождаются люди, идущие напролом к своим целям, стараясь достичь всего своими силами, \n\
при этом они считают что законы принятые в обществе только мешают их духовному и личному развитию.\n",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
    ],
  }),
};
export default opisaniyaLet;
