<template>
  <div align="center">
    <h1>Коляды Даръ {{ LETO }}</h1>
    <div style="page-break-after: always"></div>
    <table border="0" class="zagolovok" width="800px">
      <tr>
        <th class="bok" width="33%">
          Лесной Орёл <br />
          10-е Лѣто 53-го Круга<br />
          на Круголѣте Числобога
        </th>
        <th>
          <span class="title red" width="34%">ЭПОХА ВОЛКА</span>
        </th>
        <th class="bok" width="33%">
          Лѣто 13030<br />отъ Великай Стужи<br />на Круголѣте Числобога
        </th>
      </tr>
    </table>
    <Ramhat></Ramhat>
  </div>
</template>

<script>
import Ramhat from "./Ramhat.vue";

export default {
  name: "Calendar",
  components: {
    Ramhat,
  },
  methods: {
    tekuschee_leto: function () {
      const current_grig_date = new Date();
      if(current_grig_date.getMonth() < 9) {
          this.LETO = 5507 + current_grig_date.getFullYear();
      }
      if(current_grig_date.getMonth() > 9) {
          this.LETO = 5508 + current_grig_date.getFullYear();
      }
    },
  },
  data() {
    return {
      LETO: 7530,
      nazvzniya_let: [
        "Земной Путь",
        "Чёрный Жрец",
        "Звёздная Дева",
        "Звёздный Мир",
        "Огненный Свиток",
        "Огненный Феникс",
        "Жёлтый Лис",
        "Жёлтый Дракон",
        "Зелёный Змей",
        "Лесной Орёл",
        "Небесный Дельфин",
        "Небесный Конь",
        "Морской Пёс",
        "Морской Тур",
        "Лунный Дом",
        "Лунный Храм",
        "Странник Божий",
        "Белый Жрец",
        "Чёрная Жрица",
        "Земной Мир",
        "Красный Свиток",
        "Звёздный Феникс",
        "Огненный Лис",
        "Огненный Дракон",
        "Золотой Змей",
        "Золотой Орёл",
        "Зелёный Дельфин",
        "Лесной Конь",
        "Песец",
        "Небесный Тур",
        "Морской Дом",
        "Храм Бога Морей",
        "Лунный Странник",
        "Лунный Жрец",
        "Белая Дева",
        "Явь Божия",
        "Чёрный Свиток",
        "Чёрный Феникс",
        "Звёздный Лис",
        "Красный Дракон",
        "Огненный Змей",
        "Огненный Орёл",
        "Золотой Дельфин",
        "Златый Конь",
        "Лесной Пёс",
        "Лесной Тур",
        "Небесный Дом",
        "Небесный Храм",
        "Водный Путь",
        "Жрец Моря",
        "Жрица Луны",
        "Лунный Мир",
        "Белый Свиток",
        "Белый Феникс",
        "Земной Феникс",
        "Чёрный Дракон",
        "Звёздный Змей",
        "Звёздный Орёл",
        "Огненный Дельфин",
        "Огненный Конь",
        "Жёлтый Пёс",
        "Золотой Тур",
        "Лесной Дом",
        "Год Спирали",
        "Сварожий Путь",
        "Жрец Неба",
        "Морская Жрица",
        "Морской Мир",
        "Лунный Свиток",
        "Лунный Феникс",
        "Белый Лис",
        "Белый Дракон",
        "Чёрный Змей",
        "Чёрный Орёл",
        "Звёздный Дельфин",
        "Звёздный Конь",
        "Огненный Пёс",
        "Огненный Тур",
        "Солнечный Дом",
        "Храм Солнца",
        "Лесной Странник",
        "Год Друида",
        "Небесная Дева",
        "Небесная Явь",
        "Синий Свиток",
        "Морской Феникс",
        "Лунная Навь",
        "Лунный Дракон",
        "Белый Змей",
        "Белый Орёл",
        "Чёрный Дельфин",
        "Чёрный Конь",
        "Звёздный Пёс",
        "Звёздный Тур",
        "Огненный Дом",
        "Храм Инглии",
        "Солнечный Странник",
        "Жрец Солнца",
        "Друидесса",
        "Лесной Мир",
        "Небесный Свиток",
        "Феникс Небесный",
        "Морской Лис",
        "Морской Дракон",
        "Лунный Змей",
        "Лунный Орёл",
        "Белый Дельфин",
        "Белый Конь",
        "Чёрный Пёс",
        "Чёрный Тур",
        "Звёздный Дом",
        "Звёздный Храм",
        "Огненный Странник",
        "Огненный Жрец",
        "Солнечная Жрица",
        "Солнечный Мир",
        "Зеленый Свиток",
        "Феникс Леса",
        "Небесная Навь",
        "Небесный Дракон",
        "Морской Змей",
        "Морской Орёл",
        "Лунный Дельфин",
        "Лунный Конь",
        "Белый Пёс",
        "Белый Тур",
        "Земной Дом",
        "Земной Храм",
        "Звёздный Путь",
        "Звёздный Жрец",
        "Жрица Огня",
        "Огненный Мир",
        "Золотой Свиток",
        "Солнечный Феникс",
        "Лесной Лис",
        "Лесной Дракон",
        "Небесный Змей",
        "Небесный Орёл",
        "Морской Дельфин",
        "Морской Конь",
        "Лунный Пёс",
        "Лунный Тур",
        "Божий Дом",
        "Священный Храм Бога",
      ],
    };
  },
};
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
</style>
